// 头条面试题
// • 在无限的整数序列 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, ...中找到第 n 个数字。注意:n 是正数且在32位整数范围内 ( n < 231)。
// • 将一个按照升序排列的有序数组，转换为一棵高度平衡二叉搜索树。本题中，一个高度平衡二叉树是指一个二叉树每个节点 的左右两个子树的高度差的绝对值不超过 1。
// • A和B玩抛硬币游戏，AB轮流抛一枚硬币，谁先抛到正面谁就获胜并结束游戏，硬币两面均匀。A先抛，请问A获胜的概率是多少？
// • 请实现一个eventEmitter，拥有四个方法on, off, once 和 trigger
// • 输入一个int型数组的最大连续子数组（所有元素加和最大）各个元素之和，保证数组中至少有一个正数。
// • versions是一个项目的版本号列表，因多人维护，不规则。var versions = ['1.45.0', ' 1.5', '6', '3.3.3.3.3.3.3']。要求从小到大排序，注意'1.45'比'1.5'大。
// • hooks实现原理
// • 0.1 + 0.2 为什么不等于0.3
// • 浏览器事件循环跟node事件循环的区别
// • antd autocomplete组件怎么设计？
// • 假设一个秒杀页面，需要通过api获取服务器时间戳。页面上线后，用户反馈秒杀倒计时忽前忽后，但不会超前于真实时间。怎么排查，可能的原因是什么？
// • 实现instanceof
// • 移动端适配方案具体实现以及对比
// • position属性每个值的区别
