// 一面：
//     1. 计算机原理相关： 进程调度有哪几种方式(操作系统) 。
//     2. 原型原型链
//     3. web性能优化
//     4. webpack如何写plugin
//     5. vue数据响应式原理
//     6.vue3的新特性
//     7. 代码实现： 实现Array.prototype.reduce方法
//     8. 实现   12345678.002345   ->   12,345,678.002345
//     9. 实现   数组里找任意两个数相加值为一个目标值的算法（输出下标）
//     如：   [2,4,5,6,7,1,8]   target = 8   最终输出为[[0,3], [4,5]]

// 二面：
//     1. 计算机网络原理，为什么tcp有拥塞控制，tcp如何实现拥塞控制，网络发生拥塞了又咋办(总之问的很细)
//     2. dns解析的过程，域名解析的顺序，cdn的原理
//     3. 基本依托于项目聊，聊微前端的技术架构
//     4. qiankun框架的实现(对single spa的封装， 样式隔离的原理，js隔离的原理)
//     5. react native的大致原理
//     6. 为什么要用qiankun重构去掉iframe
//     7. 如何管理小组，任务分配的(因为个人是前端小组长)
//     8. 写了基于发布订阅者模式的EventBus（过程中还问了 数据的引用和值的区别）

// 三面：
//     1. 聊项目，谈人生，谈规划，谈理想(哈哈)
//     2. 项目遇到的困难，如何解决，自己觉得哪些是亮点
//     3. 开放性问题，考察算法和思维逻辑  与 现实问题相结合
//         1000个瓶子装了水，其中有1个有毒，这里有10只小白鼠，每个小白鼠只能喝一次水，如何找出有毒的那一瓶水。
//         折半查找，每次排除一半的水 (水是可以随意混合的 )
//     4. 除了简历上的，还在哪些方面深入或者学习。
