// 一面主要考察：

// 简单自我介绍，介绍项目，技术栈?
// React和vue的比较、React Diff 算法?
// 移动端高清方案如何解决?
// 面向对象如何实现？需要复用的变量怎么处理?
// 移动端300ms延时的原因？如何处理？
// 主流框架的数据单向 / 双向绑定实现原理?

// 二面、三面主要考察：

// 简述项目，React vue区别virsualDOM实现；
// Http code码?
// 移动端rem布局如何实现? 简述原理?
// Rollup和webpack区别, treeshaking是什么?
// TCP三次握手的过程，get post请求的区别?
// Http 请求包含哪些字段，分别是什么意思？
// Js 有哪些数据类型 如何判断? null 和undefined区别 应用场景?
// DOM基础知识，添加元素,删除元素等；DOM节点类型；
// 正则表达式如何匹配一段url ？在正则表达式中有哪几种作用？
// 移动端优化方式？离线包是如何实现的？

// 四面＋HR面总结：

// 五面的面试官是高P，主要关注我在团队中的角色。
// 我对自己的定义集中在参与前端技术栈选型&推动新的前端架构&参与对新人培训指导等。
